In [11]:
import os
import configparser
import pandas
from pyspark.sql import SparkSession

In [12]:
config = configparser.ConfigParser()
config.read('dl.cfg')

os.environ['AWS_ACCESS_KEY_ID'] = config['AWS']['AWS_ACCESS_KEY_ID']
os.environ['AWS_SECRET_ACCESS_KEY'] = config['AWS']['AWS_SECRET_ACCESS_KEY']
    
input_data = config['DATALAKE']['INPUT_DATA']
output_data = config['DATALAKE']['OUTPUT_DATA']

In [13]:
spark = SparkSession \
        .builder \
        .config("spark.jars.packages", "org.apache.hadoop:hadoop-aws:2.7.0") \
        .getOrCreate()

In [6]:
df_songplays = spark.read.parquet(os.path.join(output_data, 'songplays/year=*/month=*/*.parquet'))
df_songplays.limit(3).toPandas()

,songplay_id,start_time,user_id,level,song_id,artist_id,session_id,location,user_agent
0,369367187456,2018-11-26,49,paid,SOWVYWK12A8C14141F,ARX395D1187FB41D91,959,"San Francisco-Oakland-Hayward, CA",Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20...
1,369367187457,2018-11-21,97,paid,SOOUGRM12A58A795E1,AROWJKL1187B9B4B4B,797,"Lansing-East Lansing, MI","""Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/5..."
2,369367187458,2018-11-04,44,paid,SONCWGI12A8C1393C4,ARDGAO91187B989156,196,"Waterloo-Cedar Falls, IA",Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; r...

In [7]:
df_artists = spark.read.parquet(os.path.join(output_data, 'artists/'))
df_artists.limit(3).toPandas()

,artist_id,artist_name,artist_location,artist_latitude,artist_longitude
0,ARIDEBJ1187B9A3754,Rolando Villazon/Evelino Pidò/Orchestre Philha...,,NaN,NaN
1,ARIBQJ21187FB48B54,Alban Berg Quartett,,NaN,NaN
2,AR1591T1187B9A01CD,The Dream Syndicate,"Los Angeles, CA",34.05349,-118.24532

In [17]:
df_songs = spark.read.parquet(os.path.join(output_data, 'songs/'))
df_songs.limit(3).toPandas()

,song_id,title,artist_id,year,duration,_year,_artist_id
0,SOROAMT12A8C13C6D0,Me gustan mas los perros que los hombres (con ...,ARWUDTF1187B9AA096,2008,101.85098,2008,ARWUDTF1187B9AA096
1,SOVBRVG12A8C13DDCE,Millions starved and we became skinnier and sk...,ARYOIZG1187FB41E30,2006,594.75546,2006,ARYOIZG1187FB41E30
2,SOTVNYJ12A8C13A6A7,Dogghouse In Your Mouth (feat. King Lou_ Kokan...,ARJDBIN1187B9ABFD1,0,403.40853,0,ARJDBIN1187B9ABFD1

In [15]:
df_time = spark.read.parquet(os.path.join(output_data, 'time/'))
df_time.limit(3).toPandas()

   start_time  hour  day  week weekday  year  month
0  2018-11-03     0    3    44       6  2018     11
1  2018-11-24     0   24    47       6  2018     11
2  2018-11-30     0   30    48       5  2018     11

In [16]:
df_users = spark.read.parquet(os.path.join(output_data, 'users/'))
df_users.limit(3).toPandas()

  userId firstName   lastName gender level
0     88  Mohammad  Rodriguez      M  free
1     75    Joseph  Gutierrez      M  free
2     53   Celeste   Williams      F  free